Repository: sunpebble/fresh-pantry
Catalog: apps/ios/FreshPantry/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, fr, ja

# mealPlan.template.saved
source: 已存为模板
en: Saved as Template
fr: Enregistré comme modèle
ja: テンプレートとして保存しました

# mealPlan.template.title
source: 膳食模板
en: Meal Templates
fr: Modèles de repas
ja: 献立テンプレート

# mealPlan.title
source: 膳食计划
en: Meal Plan
fr: Plan de repas
ja: 献立プラン

# mealPlan.today
source: 今天
en: Today
fr: Aujourd'hui
ja: 今日

# mealPlan.today.dated %@
source: 今天 · %@
en: Today · %@
fr: Aujourd'hui · %@
ja: 今日 ・ %@

# mealPlan.todayTag
source: ，今天
en: , today
fr: , aujourd'hui
ja: 、今日

# mealPlan.updateFailed
source: 更新失败,请重试
en: Update failed. Please try again.
fr: Échec de la mise à jour. Veuillez réessayer.
ja: 更新に失敗しました。再試行してください

# mealPlan.weeklyPlan
source: 周派餐
en: Weekly Meal Plan
fr: Plan de repas hebdomadaire
ja: 週間献立

# notification.dailySummary.body
source: 查看今天到期 / 已过期食材
en: See what expires or has expired today
fr: Voir les aliments qui expirent ou ont expiré aujourd'hui
ja: 今日期限・期限切れの食材を確認

# notification.dailySummary.bodyWithLowStock %lld
source: 查看今天到期 / 已过期食材 · 库存不足 %lld 项
en: See today's expiring items · %lld running low
fr: Aliments du jour · %lld en stock faible
ja: 今日期限の食材を確認 · 在庫不足 %lld 件

# notification.dailySummary.title
source: 每日临期提醒
en: Daily expiry check
fr: Rappel quotidien des péremptions
ja: 毎日の期限チェック

# notification.expiry.body %@ %@ %lld
source: %1$@ %2$@ 还剩 %3$lld 天
en: %1$@ (%2$@) — %3$lld days left
fr: %1$@ (%2$@) — %3$lld jours restants
ja: %1$@ %2$@ あと%3$lld日

# notification.expiry.title %lld
source: %lld 天后过期
en: Expires in %lld days
fr: Expire dans %lld jours
ja: %lld日後に期限切れ

# paywall.close
source: 关闭
en: Close
fr: Fermer
ja: 閉じる

# paywall.feature.ai.detail
source: 粘贴文本一键入库、清冰箱生成菜谱
en: Add items from pasted text, and generate recipes from what's in your fridge
fr: Ajoutez des articles depuis un texte collé et générez des recettes à partir de votre frigo
ja: テキストを貼り付けるだけで在庫登録、冷蔵庫の食材からレシピ生成

# paywall.feature.ai.title
source: AI 助手
en: AI Assistant
fr: Assistant IA
ja: AIアシスタント

# paywall.feature.household.detail
source: 全家共用一份库存与购物清单
en: Share one inventory and shopping list with your whole family
fr: Partagez un seul stock et une liste de courses avec toute la famille
ja: 家族全員で在庫と買い物リストを共有できます

# paywall.feature.household.title
source: 家庭共享
en: Family Sharing
fr: Partage familial
ja: ファミリー共有

# paywall.feature.inventory.detail %lld
source: 免费版可记录 %lld 条
en: The free version stores up to %lld items
fr: La version gratuite enregistre jusqu'à %lld articles
ja: 無料版では %lld 件まで記録できます

# paywall.feature.inventory.title
source: 不限量库存
en: Unlimited Inventory
fr: Stock illimité
ja: 在庫件数の上限なし

# paywall.feature.mealPlan.detail
source: 按周安排每天做什么菜
en: Plan what to cook each day of the week
fr: Planifiez ce que vous cuisinez chaque jour de la semaine
ja: 1週間分の毎日の献立を計画できます

# paywall.feature.mealPlan.title
source: 周派餐
en: Weekly Meal Plan
fr: Plan de repas hebdomadaire
ja: 週間献立

# paywall.footer.note
source: 一次购买，长期使用，支持家庭共享。
en: Pay once, use forever — family sharing included.
fr: Payez une fois, utilisez pour toujours — le partage familial est inclus.
ja: 一度のお支払いでずっとご利用いただけます。ファミリー共有にも対応。

# paywall.locked.description
source: %@是 Pro 功能。
en: %@ is a Pro feature.
fr: %@ est une fonctionnalité Pro.
ja: %@ は Pro 機能です

# paywall.locked.learnMore
source: 了解 Pro
en: Learn About Pro
fr: En savoir plus sur Pro
ja: Pro について詳しく

# paywall.purchase.buy
source: 一次买断 · %@
en: One-time purchase · %@
fr: Achat unique · %@
ja: 買い切り · %@

# paywall.purchase.loading
source: 加载中…
en: Loading…
fr: Chargement…
ja: 読み込み中…

# paywall.purchase.unavailable
source: 商品暂不可用
en: This item isn't available right now.
fr: Cet article n'est pas disponible pour le moment.
ja: この商品は現在ご利用いただけません

# paywall.purchase.unlocked
source: 已解锁
en: Unlocked
fr: Débloqué
ja: アンロック済み

# paywall.restore
source: 恢复购买
en: Restore Purchase
fr: Restaurer l'achat
ja: 購入を復元

# paywall.title
source: 升级 Pro
en: Upgrade to Pro
fr: Passer à Pro
ja: Pro にアップグレード

# pro.error.nothingToRestore
source: 没有找到可恢复的购买
en: No previous purchase was found to restore.
fr: Aucun achat précédent trouvé à restaurer.
ja: 復元できる購入が見つかりませんでした

# pro.error.productLoadFailed %@
source: 商品信息加载失败：%@
en: Couldn't load item info: %@
fr: Impossible de charger les informations de l'article : %@
ja: 商品情報の読み込みに失敗しました：%@

# pro.error.productNotReady
source: 商品信息还没加载好，稍后再试
en: Item info isn't ready yet. Please try again shortly.
fr: Les informations de l'article ne sont pas encore prêtes. Réessayez dans un instant.
ja: 商品情報の準備がまだできていません。しばらくしてからもう一度お試しください

# pro.error.productUnavailable
source: 商品暂不可用，请稍后再试
en: This item isn't available right now. Please try again later.
fr: Cet article n'est pas disponible pour le moment. Veuillez réessayer plus tard.
ja: この商品は現在ご利用いただけません。しばらくしてからもう一度お試しください

# pro.error.purchaseIncomplete %@
source: 购买没有完成：%@
en: The purchase didn't complete: %@
fr: L'achat ne s'est pas terminé : %@
ja: 購入が完了しませんでした：%@

# pro.purchasePending
source: 购买请求已提交，批准后自动解锁
en: Your purchase request was submitted. It unlocks automatically once approved.
fr: Votre demande d'achat a été envoyée. Le déblocage sera automatique dès son approbation.
ja: 購入リクエストを送信しました。承認され次第、自動的にアンロックされます

# recipe.cookMode.close
source: 关闭
en: Close
fr: Fermer
ja: 閉じる

# recipe.cookMode.exit
source: 退出烹饪模式
en: Exit Cook Mode
fr: Quitter le mode cuisine
ja: 料理モードを終了

# recipe.cookMode.finish
source: 完成
en: Done
fr: Terminé
ja: 完了

# recipe.cookMode.finishAndExit
source: 完成并退出烹饪模式
en: Finish and exit Cook Mode
fr: Terminer et quitter le mode cuisine
ja: 完了して料理モードを終了

# recipe.cookMode.ingredients
source: 食材
en: Ingredients
fr: Ingrédients

# recipe.cookMode.ingredientsQuickCheck
source: 食材速查
en: Ingredient Quick Check
fr: Vérification rapide des ingrédients
ja: 食材クイックチェック

# recipe.cookMode.next
source: 下一步
en: Next
fr: Suivant
ja: 次の手順

# recipe.cookMode.previous
source: 上一步
en: Previous
fr: Précédent
ja: 前の手順

# recipe.cookMode.stepLabel %lld %lld
source: 第 %lld / %lld 步
en: Step %lld / %lld
fr: Étape %lld / %lld
ja: %lld / %lld番目の手順

# recipe.cookMode.timerLabel %@
source: 计时 · %@
en: Timer · %@
fr: Minuteur · %@
ja: タイマー ・ %@

# recipe.cookMode.timerPaused %@
source: 暂停计时,剩余 %@
en: Pause timer, %@ left
fr: Mettre en pause, %@ restant
ja: タイマーを一時停止、残り%@

# recipe.cookMode.timerStart %@
source: 开始计时 %@
en: Start timer %@
fr: Démarrer le minuteur %@
ja: タイマー開始 %@

# recipe.cookMode.viewIngredients
source: 查看食材清单
en: View ingredient list
fr: Voir la liste des ingrédients
ja: 食材リストを見る

# recipe.deduction.applyFailed
source: 扣减失败，请重试。
en: Deduction failed. Please try again.
fr: Échec de la déduction. Veuillez réessayer.
ja: 減算に失敗しました。再試行してください。

# recipe.deduction.confirmDeduct %lld
source: 确认扣减 (%lld)
en: Confirm Deduction (%lld)
fr: Confirmer la déduction (%lld)
ja: 減算を確認 (%lld)

# recipe.deduction.deduct
source: 扣减
en: Deduct
fr: Déduire
ja: 減算

# recipe.deduction.deductStock
source: 扣库存
en: Deduct
fr: Déduire
ja: 在庫を減算

# recipe.deduction.deducting
source: 扣减中…
en: Deducting…
fr: Déduction en cours…
ja: 減算中…

# recipe.deduction.deselectAll
source: 取消全选
en: Deselect All
fr: Tout désélectionner
ja: すべて選択解除

# recipe.deduction.emptyMessage
source: 这道菜还没有可对照的食材清单。
en: This dish has no matching ingredient list yet.
fr: Ce plat n'a pas encore de liste d'ingrédients correspondante.
ja: この料理には対応する食材リストがありません。

# recipe.deduction.emptyTitle
source: 没有待扣减的食材
en: No Ingredients to Deduct
fr: Aucun ingrédient à déduire
ja: 減算対象の食材がありません

# recipe.deduction.noBatchAvailable
source: 无可用批次
en: No Batch Available
fr: Aucun lot disponible
ja: 利用可能なバッチがありません

# recipe.deduction.noMatchSkipped
source: 库存中没有匹配项,这条将被跳过。
en: No match in inventory — this item will be skipped.
fr: Aucune correspondance dans l'inventaire — cet article sera ignoré.
ja: 在庫に一致する項目がないため、この項目はスキップされます。

# recipe.deduction.noneDeductible
source: 这道菜的食材都不在库存里,没有可扣减的项。
en: None of this dish's ingredients are in your inventory — nothing to deduct.
fr: Aucun des ingrédients de ce plat n'est dans votre inventaire — rien à déduire.
ja: この料理の食材は在庫にないため、減算対象がありません。

# recipe.deduction.recipeNeeds %@
source: 菜谱需要 %@
en: Recipe needs %@
fr: La recette nécessite %@
ja: レシピに必要な量：%@

# recipe.deduction.selectAll
source: 全选
en: Select All
fr: Tout sélectionner
ja: すべて選択

# recipe.deduction.skip
source: 跳过
en: Skip
fr: Ignorer
ja: スキップ

# recipe.deduction.sourceBatch
source: 扣减来源批次
en: Deduct From Batch
fr: Déduire du lot
ja: 減算元のバッチ

# recipe.deduction.title
source: 审核扣库存
en: Review Deduction
fr: Vérifier la déduction
ja: 在庫減算を確認

# recipe.deduction.unnamed
source: (无名)
en: (Unnamed)
fr: (Sans nom)
ja: （無名）

# recipe.detail.addFailed
source: 添加失败，请重试
en: Add failed. Please try again.
fr: Échec de l'ajout. Veuillez réessayer.
ja: 追加に失敗しました。再試行してください

# recipe.detail.addMissingItems %lld
source: 加购缺少的 %lld 件
en: Add %lld missing items to shopping list
fr: Ajouter %lld articles manquants à la liste de courses
ja: 不足している%lld件を購入リストに追加

# recipe.detail.addToPlan
source: 加入膳食计划
en: Add to Meal Plan
fr: Ajouter au plan de repas
ja: 献立に追加

# recipe.detail.addToPlanFailed
source: 加入计划失败,请重试
en: Failed to add to plan. Please try again.
fr: Échec de l'ajout au plan. Veuillez réessayer.
ja: 計画への追加に失敗しました。再試行してください

# recipe.detail.addToPlanTitle
source: 加入计划
en: Add to Plan
fr: Ajouter au plan
ja: 計画に追加

# recipe.detail.addedPartialFailed %lld
source: 已添加 %lld 项，部分添加失败，请重试
en: Added %lld items; some failed. Please try again.
fr: %lld articles ajoutés ; certains ont échoué. Veuillez réessayer.
ja: %lld件を追加しましたが、一部失敗しました。再試行してください

# recipe.detail.addedToPlan %@
source: 已加入 %@ 的膳食计划
en: Added to the meal plan for %@
fr: Ajouté au plan de repas du %@
ja: %@の献立に追加しました

# recipe.detail.addedToShopping %lld
source: 已添加 %lld 项到购物清单
en: Added %lld items to the shopping list
fr: %lld articles ajoutés à la liste de courses
ja: 購入リストに%lld件を追加しました

# recipe.detail.adding
source: 加入中…
en: Adding…
fr: Ajout en cours…
ja: 追加中…

# recipe.detail.aiRewrite
source: AI 改写菜谱
en: AI Rewrite Recipe
fr: Réécrire la recette avec l'IA
ja: AIでレシピを書き換え

# recipe.detail.aiRewriteHint
source: AI 会生成一个改写版本供你审核保存,原菜谱不变。
en: AI will generate a rewritten version for you to review and save; the original recipe stays unchanged.
fr: L'IA générera une version réécrite que vous pourrez vérifier et enregistrer ; la recette originale reste inchangée.
ja: AIが書き換え版を生成し、確認・保存できます。元のレシピは変更されません。

# recipe.detail.available
source: 已有
en: Available
fr: Disponible
ja: あり

# recipe.detail.cancel
source: 取消
en: Cancel
fr: Annuler
ja: キャンセル

# recipe.detail.cook
source: 做菜
en: Cook
fr: Cuisiner
ja: 料理する

# recipe.detail.cookAndDeduct
source: 做菜并扣减库存
en: Cook and Deduct From Inventory
fr: Cuisiner et déduire de l'inventaire
ja: 料理して在庫を減算

# recipe.detail.cookDeductHint
source: 打开扣减审核,确认前可调整或跳过任意食材。
en: Opens the deduction review — you can adjust or skip any ingredient before confirming.
fr: Ouvre la vérification de déduction — vous pouvez ajuster ou ignorer tout ingrédient avant de confirmer.
ja: 減算確認画面を開きます。確認前に食材の調整やスキップができます。

# recipe.detail.cookDeductPrompt
source: 做完了，要扣减库存吗？
en: All done — deduct from inventory?
fr: Terminé — déduire de l'inventaire ?
ja: 完了しました。在庫を減算しますか？

# recipe.detail.cookMode
source: 烹饪模式
en: Cook Mode
fr: Mode cuisine
ja: 料理モード

# recipe.detail.cookingSteps
source: 烹饪步骤
en: Cooking Steps
fr: Étapes de cuisson
ja: 調理手順

# recipe.detail.dayAfterTomorrow
source: 后天
en: The Day After Tomorrow
fr: Après-demain
ja: 明後日

# recipe.detail.deductedItems %lld
source: 已扣减 %lld 项库存
en: Deducted %lld inventory items
fr: %lld articles d'inventaire déduits
ja: 在庫を%lld件減算しました

# recipe.detail.delete
source: 删除
en: Delete
fr: Supprimer
ja: 削除

# recipe.detail.deleteConfirm %@
source: 确定要删除「%@」吗？此操作无法撤销。
en: Delete “%@”? This can't be undone.
fr: Supprimer « %@ » ? Cette action est irréversible.
ja: 「%@」を削除しますか？この操作は元に戻せません。

# recipe.detail.deleteTitle
source: 删除食谱
en: Delete Recipe
fr: Supprimer la recette
ja: レシピを削除

# recipe.detail.done
source: 完成
en: Done
fr: Terminé
ja: 完了

# recipe.detail.edit
source: 编辑
en: Edit
fr: Modifier
ja: 編集

# recipe.detail.enterCookMode
source: 进入烹饪模式
en: Enter Cook Mode
fr: Entrer en mode cuisine
ja: 料理モードに入る

# recipe.detail.favorite
source: 收藏
en: Favorite
fr: Favori
ja: お気に入り

# recipe.detail.goToDeduct
source: 去扣减
en: Go Deduct
fr: Aller déduire
ja: 減算する

# recipe.detail.haveCount %lld %lld
source: 已有 %lld/%lld
en: Have %lld/%lld
fr: %lld/%2$lld disponibles
ja: %lld/%lld あり

# recipe.detail.ingredientList
source: 食材清单
en: Ingredient List
fr: Liste des ingrédients
ja: 食材リスト

# recipe.detail.leftoverPrefillHint
source: 按冷藏 3 天保质期预填,保存前可修改。
en: Prefilled with a 3-day fridge shelf life — you can edit before saving.
fr: Prérempli avec une durée de conservation de 3 jours au réfrigérateur — modifiable avant l'enregistrement.
ja: 冷蔵3日の賞味期限で自動入力されます。保存前に編集できます。

# recipe.detail.minutes %lld
source: %lld 分钟
en: %lld min
fr: %lld min
ja: %lld分

# recipe.detail.missing
source: 缺少
en: Missing
fr: Manquant
ja: 不足

# recipe.detail.missingAlreadyInShopping
source: 缺少的食材已在购物清单中
en: Missing ingredients are already on the shopping list
fr: Les ingrédients manquants sont déjà dans la liste de courses
ja: 不足している食材は購入リストに追加済みです

# recipe.detail.noThanks
source: 不用了
en: No Thanks
fr: Non merci
ja: しない

# recipe.detail.notNow
source: 暂不
en: Not Now
fr: Pas maintenant
ja: 今はしない

# recipe.detail.perServingApprox
source: 每份 · 约
en: Per Serving · Approx.
fr: Par portion · env.
ja: 1人分 ・ 目安

# recipe.detail.prep
source: 备料
en: Prep
fr: Préparation
ja: 下ごしらえ

# recipe.detail.preparing
source: 准备中…
en: Preparing…
fr: Préparation…
ja: 準備中…

# recipe.detail.recipeActions
source: 食谱操作
en: Recipe Actions
fr: Actions sur la recette
ja: レシピの操作

# recipe.detail.rewriteFailed %@
source: 改写失败:%@
en: Rewrite failed: %@
fr: Échec de la réécriture : %@
ja: 書き換えに失敗しました：%@

# recipe.detail.rewriteLowCal
source: 低卡少油版
en: Low-Cal, Less Oil
fr: Faible en calories, moins d'huile
ja: 低カロリー・少油版

# recipe.detail.rewriteSplitSteps
source: 整理步骤(拆成单步)
en: Simplify Steps (Split Into Single Actions)
fr: Simplifier les étapes (diviser en actions simples)
ja: 手順を整理（単一動作に分割）

# recipe.detail.rewriteSubstitute
source: 用我现有的食材替换
en: Substitute With What I Have
fr: Remplacer avec ce que j'ai
ja: 手持ちの食材で代用

# recipe.detail.rewriteVegetarian
source: 改成素食版
en: Make it Vegetarian
fr: Rendre végétarien
ja: ベジタリアン版にする

# recipe.detail.saveAsLeftover
source: 存为剩菜
en: Save as Leftover
fr: Enregistrer comme reste
ja: 残り物として保存

# recipe.detail.saveAsLeftoverPrompt
source: 把做好的菜存为剩菜？
en: Save this dish as a leftover?
fr: Enregistrer ce plat comme reste ?
ja: 作った料理を残り物として保存しますか？

# recipe.detail.savedToInventory %@
source: 已把「%@」存入库存
en: Saved “%@” to inventory
fr: « %@ » enregistré dans l'inventaire
ja: 「%@」を在庫に保存しました

# recipe.detail.tips
source: 小贴士
en: Tips
fr: Astuces
ja: コツ

# recipe.detail.tipsLabel %@
source: 小贴士:%@
en: Tips: %@
fr: Astuces : %@
ja: コツ：%@

# recipe.detail.today
source: 今天
en: Today
fr: Aujourd'hui
ja: 今日

# recipe.detail.tomorrow
source: 明天
en: Tomorrow
fr: Demain
ja: 明日

# recipe.detail.unfavorite
source: 取消收藏
en: Unfavorite
fr: Retirer des favoris
ja: お気に入り解除

# recipe.difficulty.level %lld
source: 难度 %lld/5
en: Difficulty %lld/5
fr: Difficulté %lld/5
ja: 難易度 %lld/5

# recipe.difficulty.unset
source: 难度未设置
en: Difficulty not set
fr: Difficulté non définie
ja: 難易度未設定

# recipe.form.addIngredient
source: 添加食材
en: Add Ingredient
fr: Ajouter un ingrédient
ja: 食材を追加

# recipe.form.addStep
source: 添加步骤
en: Add Step
fr: Ajouter une étape
ja: 手順を追加

# recipe.form.aiImport
source: AI 导入
en: AI Import
fr: Import IA
ja: AIインポート

# recipe.form.aiImportHint
source: 粘贴 懒饭 / 下厨房 的食谱链接,AI 会自动填入表单供你核对。
en: Paste a recipe link and AI will fill in the form for you to review.
fr: Collez un lien de recette et l'IA remplira le formulaire pour que vous puissiez le vérifier.
ja: レシピのリンクを貼り付けると、AIがフォームに自動入力します。確認してください。

# recipe.form.aiNotConfigured
source: 请先在 设置 › AI 助手 配置 Base URL / API Key / 模型,即可粘贴链接自动解析。
en: Set up Base URL / API Key / Model under Settings › AI Assistant first, then paste a link to auto-parse.
fr: Configurez d'abord l'URL de base / la clé API / le modèle dans Réglages › Assistant IA, puis collez un lien pour l'analyse automatique.
ja: まず 設定 › AIアシスタント で Base URL / APIキー / モデル を設定すると、リンクを貼り付けて自動解析できます。

# recipe.form.aiParsing
source: AI 解析中…
en: AI parsing…
fr: Analyse IA en cours…

# recipe.form.amountPlaceholder
source: 用量
en: Amount
fr: Quantité
ja: 量

# recipe.form.basics
source: 基础信息
en: Basic Info
fr: Informations de base
ja: 基本情報

# recipe.form.cancel
source: 取消
en: Cancel
fr: Annuler
ja: キャンセル

# recipe.form.categoryLabel
source: 分类 *
en: Category *
fr: Catégorie *
ja: 分類 *

# recipe.form.categoryPlaceholder
source: 选择分类
en: Choose a category
fr: Choisir une catégorie
ja: 分類を選択

# recipe.form.clipboardDetected
source: 已从剪贴板检测到食谱链接
en: Recipe link detected on clipboard
fr: Lien de recette détecté dans le presse-papiers
ja: クリップボードからレシピのリンクを検出しました

# recipe.form.confirm
source: 确定
en: OK
fr: OK
ja: OK

# recipe.form.continueEditing
source: 继续编辑
en: Continue Editing
fr: Continuer la modification
ja: 編集を続ける

# recipe.form.cookingTimeLabel
source: 烹饪时间 *
en: Cooking Time *
fr: Temps de cuisson *
ja: 調理時間 *

# recipe.form.coverAdd
source: 添加封面
en: Add Cover Photo
fr: Ajouter une photo de couverture
ja: カバー画像を追加

# recipe.form.coverImage
source: 封面图片
en: Cover Photo
fr: Photo de couverture
ja: カバー画像

# recipe.form.coverRemove
source: 移除
en: Remove
fr: Supprimer
ja: 削除

# recipe.form.coverRemoveLabel
source: 移除封面
en: Remove cover photo
fr: Supprimer la photo de couverture
ja: カバー画像を削除

# recipe.form.coverReplace
source: 更换
en: Replace
fr: Remplacer
ja: 変更

# recipe.form.customCategory
source: 自定义分类
en: Custom Category
fr: Catégorie personnalisée
ja: カスタム分類

# recipe.form.customCategoryPlaceholder
source: 例如：日料
en: e.g. Japanese
fr: ex. cuisine japonaise
ja: 例：和食

# recipe.form.customMinutes
source: 或自定义
en: Or customize
fr: Ou personnaliser
ja: またはカスタム

# recipe.form.descriptionLabel
source: 简介
en: Description
fr: Description
ja: 説明

# recipe.form.descriptionPlaceholder
source: 简单描述这道菜的特色…
en: Briefly describe what makes this dish special…
fr: Décrivez brièvement ce qui rend ce plat spécial…
ja: この料理の特徴を簡単に説明してください…

# recipe.form.difficulty.advanced
source: 进阶
en: Advanced
fr: Avancé
ja: 上級

# recipe.form.difficulty.easier
source: 较易
en: Fairly Easy
fr: Assez facile
ja: やや簡単

# recipe.form.difficulty.easy
source: 简单
en: Easy
fr: Facile
ja: 簡単

# recipe.form.difficulty.expert
source: 专业
en: Expert
fr: Expert
ja: プロ級

# recipe.form.difficulty.normal
source: 普通
en: Medium
fr: Moyen

# recipe.form.difficultyLabel
source: 难度 *
en: Difficulty *
fr: Difficulté *
ja: 難易度 *

# recipe.form.difficultyStars %lld
source: 难度 %lld 星
en: Difficulty %lld stars
fr: Difficulté %lld étoiles
ja: 難易度 %lld 星

# recipe.form.discard
source: 丢弃
en: Discard
fr: Abandonner
ja: 破棄

# recipe.form.discardChanges
source: 丢弃更改
en: Discard Changes
fr: Abandonner les modifications
ja: 変更を破棄

# recipe.form.discardEditConfirm %@
source: 确定要丢弃对「%@」的修改吗？
en: Discard changes to “%@”?
fr: Abandonner les modifications de « %@ » ?
ja: 「%@」の変更を破棄しますか？

# recipe.form.discardNewConfirm
source: 确定要丢弃当前填写的食谱吗？
en: Discard this recipe draft?
fr: Abandonner ce brouillon de recette ?
ja: 入力中のレシピを破棄しますか？

# recipe.form.dismiss
source: 忽略
en: Dismiss
fr: Ignorer
ja: 無視

# recipe.form.editTitle
source: 编辑食谱
en: Edit Recipe
fr: Modifier la recette
ja: レシピを編集

# recipe.form.error.atLeastOneIngredient
source: 至少一种食材
en: At least one ingredient
fr: Au moins un ingrédient
ja: 少なくとも1つの食材

# recipe.form.error.categoryRequired
source: 请选择分类
en: Choose a category
fr: Choisissez une catégorie
ja: 分類を選択してください

# recipe.form.error.difficultyInvalid
source: 请选择 1-5 颗星
en: Choose 1 to 5 stars
fr: Choisissez de 1 à 5 étoiles
ja: 1〜5の星を選択してください

# recipe.form.error.minutesInvalid
source: 请输入大于 0 的分钟数
en: Enter minutes greater than 0
fr: Saisissez un nombre de minutes supérieur à 0
ja: 0より大きい分数を入力してください

# recipe.form.error.nameRequired
source: 请填入食谱名称
en: Enter a recipe name
fr: Saisissez un nom de recette
ja: レシピ名を入力してください

# recipe.form.error.stepsRequired
source: 至少添加一个步骤
en: Add at least one step
fr: Ajoutez au moins une étape
ja: 少なくとも1つの手順を追加してください

# recipe.form.ingredientAmount
source: 食材用量
en: Ingredient amount
fr: Quantité de l'ingrédient
ja: 食材の量

# recipe.form.ingredientName
source: 食材名称
en: Ingredient name
fr: Nom de l'ingrédient
ja: 食材名

# recipe.form.ingredientNamePlaceholder
source: 食材名称
en: Ingredient name
fr: Nom de l'ingrédient
ja: 食材名

# recipe.form.ingredients
source: 食材
en: Ingredients
fr: Ingrédients

# recipe.form.minutesUnit
source: 分钟
en: minutes
fr: minutes
ja: 分

# recipe.form.moveIngredientDown
source: 下移食材
en: Move ingredient down
fr: Déplacer l'ingrédient vers le bas
ja: 食材を下に移動

# recipe.form.moveIngredientUp
source: 上移食材
en: Move ingredient up
fr: Déplacer l'ingrédient vers le haut
ja: 食材を上に移動

# recipe.form.moveStepDown
source: 下移步骤
en: Move step down
fr: Déplacer l'étape vers le bas
ja: 手順を下に移動

# recipe.form.moveStepUp
source: 上移步骤
en: Move step up
fr: Déplacer l'étape vers le haut
ja: 手順を上に移動

# recipe.form.nameLabel
source: 食谱名称 *
en: Recipe Name *
fr: Nom de la recette *
ja: レシピ名 *

# recipe.form.namePlaceholder
source: 例如：西红柿炒蛋
en: e.g. Tomato and Egg Stir-fry
fr: ex. Tomates aux œufs sautés
ja: 例：トマトと卵の炒め物

# recipe.form.newTitle
source: 新建食谱
en: New Recipe
fr: Nouvelle recette
ja: レシピを新規作成

# recipe.form.otherCategory
source: + 其他
en: + Other
fr: + Autre
ja: + その他

# recipe.form.overwrite
source: 覆盖
en: Overwrite
fr: Écraser
ja: 上書き

# recipe.form.overwriteContent
source: 覆盖已填内容
en: Overwrite Existing Content
fr: Écraser le contenu existant
ja: 入力済みの内容を上書き

# recipe.form.parse
source: 解析
en: Parse
fr: Analyser

# recipe.form.parseFailed %@
source: 解析失败：%@
en: Parse failed: %@
fr: Échec de l'analyse : %@
ja: 解析に失敗しました：%@

# recipe.form.parseSuccessOverwrite
source: 解析成功。表单中已填写的内容将被解析结果替换。
en: Parsed successfully. The form's current content will be replaced with the result.
fr: Analyse réussie. Le contenu actuel du formulaire sera remplacé par le résultat.
ja: 解析に成功しました。フォームの入力内容は解析結果に置き換えられます。

# recipe.form.photoProcessFailed
source: 无法处理该照片，请换一张重试。
en: Couldn't process this photo. Try another one.
fr: Impossible de traiter cette photo. Essayez-en une autre.
ja: この写真を処理できませんでした。別の写真でお試しください。

# recipe.form.photoReadFailed %@
source: 读取照片失败：%@
en: Failed to read photo: %@
fr: Échec de la lecture de la photo : %@
ja: 写真の読み込みに失敗しました：%@

# recipe.form.photoReadFailedRetry
source: 读取照片失败，请重试。
en: Failed to read photo. Please try again.
fr: Échec de la lecture de la photo. Veuillez réessayer.
ja: 写真の読み込みに失敗しました。再試行してください。

# recipe.form.removeIngredient
source: 移除食材
en: Remove ingredient
fr: Supprimer l'ingrédient
ja: 食材を削除

# recipe.form.removeStep
source: 移除步骤
en: Remove step
fr: Supprimer l'étape
ja: 手順を削除

# recipe.form.retry
source: 重试
en: Retry
fr: Réessayer
ja: 再試行

# recipe.form.save
source: 保存
en: Save
fr: Enregistrer

# recipe.form.saveFailed
source: 保存失败
en: Save Failed
fr: Échec de l'enregistrement
ja: 保存に失敗しました

# recipe.form.saveFailedRetry
source: 保存失败，请重试
en: Save failed. Please try again.
fr: Échec de l'enregistrement. Veuillez réessayer.
ja: 保存に失敗しました。再試行してください

# recipe.form.saving
source: 保存中…
en: Saving…
fr: Enregistrement…

# recipe.form.selectCategory
source: 选择分类
en: Choose Category
fr: Choisir une catégorie
ja: 分類を選択

# recipe.form.selectUnit
source: 选择单位
en: Choose Unit
fr: Choisir une unité
ja: 単位を選択

# recipe.form.stepPlaceholder
source: 输入下一步…
en: Enter the next step…
fr: Saisissez l'étape suivante…
ja: 次の手順を入力…

# recipe.form.steps
source: 步骤
en: Steps
fr: Étapes
ja: 手順

# recipe.form.tagsLabel
source: 标签
en: Tags
fr: Étiquettes
ja: タグ

# recipe.form.tipsLabel
source: 烹饪贴士
en: Cooking Tips
fr: Astuces de cuisson
ja: 調理のヒント
